# Используем официальный образ Python в качестве базового.
FROM python:3.11

# Устанавливаем переменные окружения для более предсказуемого и непрерывного выполнения.
ENV PYTHONDONTWRITEBYTECODE 1
ENV PYTHONUNBUFFERED 1

# Устанавливаем рабочую директорию в контейнере.
WORKDIR /code

# Копируем файл с зависимостями в контейнер.
COPY requirements.txt /code/

# Устанавливаем зависимости Python.
RUN pip install --no-cache-dir -r requirements.txt

# Копируем оставшиеся файлы проекта в контейнер.
COPY . /code/

# Открываем порт, который будет использоваться приложением
EXPOSE 8000

# Команда для запуска приложения (в состоянии разработки)
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]